In [26]:
import pandas as pd
import matplotlib.pyplot as plt
import sqlite3

conn = sqlite3.connect('infldatabase.db')
cursor = conn.cursor()

In [27]:
#query
query = '''
SELECT CountryName, CountryCode, AnnualInflation
FROM InflationRates
WHERE AnnualInflation > 5
ORDER BY AnnualInflation DESC
'''
#fetches the result
df_high_inflation = pd.read_sql_query(query, conn)
#displays the result
df_high_inflation

          CountryName CountryCode  AnnualInflation
0             Lebanon         LBN       171.205491
1               Sudan         SDN       138.808460
2            Zimbabwe         ZWE       104.705171
3             Turkiye         TUR        72.308836
4            Suriname         SUR        52.446027
..                ...         ...              ...
183  Papua New Guinea         PNG         5.253239
184            France         FRA         5.222367
185          Djibouti         DJI         5.179808
186       Korea, Rep.         KOR         5.089514
187        Arab World         ARB         5.087542

[188 rows x 3 columns]

# Inflation Rates for 2022

### Which country had the highest inflation rate in 2022?

In [28]:
conn = sqlite3.connect('infldatabase.db')
cursor = conn.cursor()

highest_rate = '''SELECT CountryName, AnnualInflation
FROM InflationRates
WHERE AnnualInflation = (SELECT MAX(AnnualInflation) FROM InflationRates)
'''

df_high_inflation = pd.read_sql_query(highest_rate,conn)
df_high_inflation

  CountryName  AnnualInflation
0     Lebanon       171.205491

What was the global annual inflation rate in 2022?

In [29]:
conn = sqlite3.connect('infldatabase.db')
cursor = conn.cursor()
print('The average global inflation in 2022 was:')

average_rate ='''SELECT AVG(AnnualInflation) AS Annual_Inflation
FROM InflationRates'''

df_average_inflation = pd.read_sql_query(average_rate, conn)
df_average_inflation

The average global inflation in 2022 was:

   Annual_Inflation
0         11.493083